<?php


namespace zetsoft\widgets\market;
// Author: jamshid Tojiboyev

use zetsoft\models\shop\ShopCategory;
use zetsoft\system\assets\ZColor;
use zetsoft\system\Az;
use zetsoft\system\kernels\ZWidget;
use zetsoft\widgets\inputes\ZHInputWidget;
use zetsoft\widgets\navigat\ZButtonWidget;

class ZFooterMenu_1 extends ZWidget
{
    /**
     * Configuration
     */
    public $config = [];
    public $_config = [

        'color' => 'white',
        'class' => 'fa fa-angle-right',
        'url' => '',
        'registrationUrl' => '',


    ];


    /**
     *
     * Plugin Events
     * https://select2.org/programmatic-control/events
     */
    public $event = [];
    public $_event = [

    ];

    public $layout = [];
    public $_layout = [

        'main' => <<<HTML
        <footer class="footer-div list sticc">
        <section class="footer-top">
            <div class="container">
                <div class="row">
                  {menulist}
                 
                </div>
            </div>
        </section>
        <section class="footer-btm">
            <div class="container">
                <div class="row zleft d-flex align-items-center text-align-center">
                    <div class="col-md-6">
                        <p class="zcolor zlr">Copyright &copy; 2020 | MarketPlace<i class="fa fa-heart zcolor"></i> by <a href="#" target="_blank" class="zcolor"">ZetSoft</a></p>
                    </div>
                    
                </div>
            </div>
        </section>
    </footer>
          
HTML,
        'menulist' => <<< HTML
  <div class="col-md-3 d-flex justify-content-center">
                        <div class="f-cat">
                            <h5 style="color: {color};">{Categories}</h5>
                            <ul class="list-unstyled">
                                
                                {categoryList}
                                
                            </ul>
                        </div>
                    </div>
HTML,

        'categoryList' => <<<HTML
        <li><a href="{url}"><i class="{class}"></i>{categoryListNames}</a></li>
HTML,
        'List' => <<<HTML
        <li id={id}><img src="{icon}"><a href="{url}"><i class="{class}"></i>{ListName}</a></li>
HTML,


        'css' => <<<CSS
            .footer-top {
                border-bottom: 1px solid #efefef!important;
                background: #10b410;
                padding: 30px 0 40px;
                position: sticky;
            }   
            .footer-div{
                 z-index: 1;    
                 position: sticky;
                 clear: both;
                 width: 100%;
                 top: 100%;
                 bottom: 0;
            } 
            .footer-btm {
                position: sticky;
                clear: both;
                width: 100%;
                top: 100%;
                bottom: 0;
                background-color: #10b410;
                border-top: 0 !important; 
            }
            .malika{
                color: #fff;
                padding: 1rem 2.4rem;
                font-size: .94rem;
                border: 2px solid #fff;
                background-color: #10b410;
                font-weight: bold;
                height: 55px;
            }
            .malika:hover{
                color: #ff9d38;
                border: 2px solid #ff9d38;
            }
            .f-cat:nth-child(4) h5{
                display: none;                        
            }
            
            .logo-area {
                padding-top: 0!important;                                               
            }
           
            input[type=text]:focus:not([readonly]){
                border-color: white!important;
                box-shadow: 0 1px 0 0 white!important;
            }
            input[type=text]::placeholder{
                color: white;
            }
            
            .md-form label{
                color: white;
            }
            .footer-btm p {
                color: #efefef;
                margin-top: 10px;
            
            }
            
            .footer-div .list{
                width: 100%;
                bottom: 0;
            }
            .back-to-top {
                border: 1px solid #10b410!important;
            }
            .zcolor {
                color: #ffffff!important;
                padding-left: 5px;
                font-size: 18px!important;
            }
            
            .f-cat .list-unstyled li img {
                display: none;
            }
            .f-cat .list-unstyled li  a {
                color: white !important;
            }
            .f-cat .list-unstyled li  a:hover {
                opacity: 0.8;
                color: grey;
            }
            .logo-text {
                font-size: 25px;
                color: white;
            }
            
            .zleft-icon i {
                color: white!important;
              
            }
            .zleft-icon i:hover {
            opacity: 0.8;
            }
            .zleft-left {
                display:flex;
                justify-content:space-around;
                 width: 70%;
                 margin-left: 20px;
            }
            .logo-footer {
                display:flex;
                justify-content:center;
                text-align: center;
                margin: 10px 0;
            }

             .logo-footer .zetshop-footer:hover {
                opacity: 0.8;
             }
              /*.f-cat h5{
                display: none;
              }*/
            

            
CSS,
        'js' => <<<JS
  \$(document).on('click', '#{id}', function(){\$("#loginNavbar").modal('show')});
 \$(document).on('click', '#fv{id}', function(){\$(fastRegisterVendor).modal('show')});
  \$(document).on('click', '#fu{id}', function(){\$(fastRegister).modal('show')});

            
JS,
    ];


    public function asset()
    {
        $this->fileCss('https://cdn.jsdelivr.net/npm/font-awesome@4.7.0/css/font-awesome.css');
    }

    public function codes()
    {

        $categoryListCode = '';
        /** @var Category[] $categories */
        
        $parent_categories = ShopCategory::find()
        ->where([
            'parent_id' => null
        ])
        ->all();

        $categories = $parent_categories;
        $count = 0;
        foreach ($categories as $category) {
                if($count==6) break;
                $categoryListCode .= strtr($this->_layout['categoryList'], [
                    '{categoryListNames}' => $category->name,
//                    '{url}' => $category->url,
                ]);
            $count++;
        }
        $categoryListCode = strtr($this->_layout['menulist'], [
            '{color}' => $this->_config['color'],
            '{Categories}' => Az::l('Категории'),
            '{categoryList}' => $categoryListCode,
            '{url}' => $this->_config['url']
        ]);

        //Info start
        $info = '';
        $info .= strtr($this->_layout['List'], [
            '{icon}' => 'http://bozorboy.com/pictures/icons/5039.png',
            '{ListName}' => 'О нашем сервисе',
            '{url}' => $this->_config['url']
        ]);
        $info .= strtr($this->_layout['List'], [
            '{icon}' => 'http://bozorboy.com/pictures/icons/5040.png',
            '{ListName}' => 'Принимаемые платежи'
        ]);
        $info .= strtr($this->_layout['List'], [
            '{icon}' => 'http://bozorboy.com/pictures/icons/5041.png',
            '{ListName}' => 'Правила доставки'
        ]);
        $info .= strtr($this->_layout['List'], [
            '{icon}' => 'http://bozorboy.com/pictures/icons/5042.png',
            '{ListName}' => 'Обработка данных'
        ]);
        $info .= strtr($this->_layout['List'], [
            '{icon}' => 'http://bozorboy.com/pictures/icons/5044.png',
            '{ListName}' => 'Наши контакты'
        ]);
        $categoryListCode .= strtr($this->_layout['menulist'], [
            '{color}' => $this->_config['color'],
            '{Categories}' => Az::l('Информация'),
            '{categoryList}' => $info,
            '{url}' => $this->_config['url']
        ]);

        $this->htm = strtr($this->_layout['categoryList'], [
            '{url}' => $this->_config['url']
        ]);

        //Info end

//Register start       
        $login = '';
        $login .= strtr($this->_layout['List'], [
            '{id}' => $this->id,
            '{icon}' => 'http://bozorboy.com/pictures/icons/5045.png',
            '{ListName}' => 'Вход',
            '{url}' => $this->_config['url']
        ]);
        $login .= strtr($this->_layout['List'], [
            '{id}' => 'fu' . $this->id,
            '{icon}' => 'http://bozorboy.com/pictures/icons/5042.png',
            '{ListName}' => 'Регистрация пользователя',
            '{url}' => $this->_config['registrationUrl']

        ]);
//Register end

        $categoryListCode .= strtr($this->_layout['menulist'], [
            '{color}' => $this->_config['color'],
            '{Categories}' => Az::l('Личный кабинет'),
            '{categoryList}' => $login,
            '{url}' => $this->_config['url']
        ]);

        $this->htm = strtr($this->_layout['main'], [
            '{color}' => $this->_config['color'],
            '{color_company}' => '#0049ff',
            '{class}' => $this->_config['class'],
            '{menulist}' => $categoryListCode,
            '{url}' => $this->_config['url']
        ]);

        $this->css = strtr($this->_layout['css'], [
            '{color}' => $this->_config['color'],
        ]);
        $this->js = strtr($this->_layout['js'], [
            '{id}' => $this->id,
        ]);

        $categoryListCode .= strtr($this->_layout['menulist'], [
            '{color}' => $this->_config['color'],
            '{Categories}' => Az::l(' '),
            '{categoryList}' => '
<div class="logo-footer mt-0">
                        <a href="" class="zetshop-footer">
                           <svg width="200" height="38" viewBox="0 0 200 38" fill="none" xmlns="http://www.w3.org/2000/svg">
<rect width="200" height="38" fill="#10B410"/>
<path fill-rule="evenodd" clip-rule="evenodd" d="M169.167 29.5C169.167 28.2114 170.211 27.1667 171.5 27.1667C172.789 27.1667 173.833 28.2114 173.833 29.5C173.833 30.7887 172.789 31.8334 171.5 31.8334C170.211 31.8334 169.167 30.7887 169.167 29.5Z" fill="white"/>
<path fill-rule="evenodd" clip-rule="evenodd" d="M182 29.5C182 28.2114 183.045 27.1667 184.333 27.1667C185.622 27.1667 186.667 28.2114 186.667 29.5C186.667 30.7887 185.622 31.8334 184.333 31.8334C183.045 31.8334 182 30.7887 182 29.5Z" fill="white"/>
<path fill-rule="evenodd" clip-rule="evenodd" d="M161 6.16667C161 5.52233 161.522 5 162.167 5H166.833C167.389 5 167.868 5.39245 167.977 5.9377L168.957 10.8333H187.833C188.181 10.8333 188.511 10.9884 188.732 11.2563C188.954 11.5242 189.044 11.877 188.979 12.2185L187.111 22.0156C186.951 22.8213 186.513 23.545 185.873 24.0601C185.236 24.5727 184.44 24.8461 183.623 24.8333H172.303C171.486 24.8461 170.691 24.5727 170.054 24.0601C169.414 23.5453 168.976 22.8219 168.816 22.0166C168.816 22.0163 168.816 22.0169 168.816 22.0166L166.867 12.2791C166.859 12.2469 166.852 12.2141 166.847 12.1809L165.877 7.33333H162.167C161.522 7.33333 161 6.811 161 6.16667ZM169.424 13.1667L171.104 21.561C171.158 21.8296 171.304 22.0709 171.517 22.2426C171.73 22.4143 171.997 22.5055 172.271 22.5002L172.293 22.5H183.633L183.656 22.5002C183.929 22.5055 184.196 22.4143 184.41 22.2426C184.622 22.0717 184.768 21.8319 184.822 21.5648L186.423 13.1667H169.424Z" fill="white"/>
<path d="M34.51 29.09L34.15 30.2C33.63 30.24 33.24 30.26 32.98 30.26C31.78 30.26 30.8 29.75 30.04 28.73C29.3 27.73 28.93 26.42 28.93 24.8C28.93 23.82 29.15 21.97 29.59 19.25C30.05 16.51 30.58 14.01 31.18 11.75C31.3 11.25 31.36 10.92 31.36 10.76C31.36 10.6 31.29 10.52 31.15 10.52C31.01 10.52 30.56 11.27 29.8 12.77C29.06 14.25 28.17 16.08 27.13 18.26C26.09 20.42 25.49 21.66 25.33 21.98C25.19 22.28 25.07 22.53 24.97 22.73C24.89 22.91 24.71 23.25 24.43 23.75C24.17 24.23 23.92 24.66 23.68 25.04C23.02 26.04 22.5 26.54 22.12 26.54C21.86 26.54 21.57 26.47 21.25 26.33C20.95 26.19 20.75 26.04 20.65 25.88C20.43 25.54 20.32 24.48 20.32 22.7C20.32 18.98 20.62 15.43 21.22 12.05C21.42 10.93 21.52 10.34 21.52 10.28C21.52 10.08 21.44 9.98 21.28 9.98C20.96 9.98 20.45 10.98 19.75 12.98L18.88 15.47C17.6 19.09 16.3 21.91 14.98 23.93C13.68 25.95 12.18 27.37 10.48 28.19L9.7 26.54C11.64 25.1 13.13 23.63 14.17 22.13C15.23 20.63 16.38 18.21 17.62 14.87L18.64 12.14C19.34 10.24 19.95 8.89 20.47 8.09C20.99 7.27 21.57 6.86 22.21 6.86C23.27 6.86 23.8 7.5 23.8 8.78C23.8 8.88 23.61 10.91 23.23 14.87C22.85 18.81 22.66 21.41 22.66 22.67C22.66 23.03 22.72 23.22 22.84 23.24C22.94 23.24 23.05 23.14 23.17 22.94C24.79 20.24 26.34 17.3 27.82 14.12C28 13.72 28.31 13.03 28.75 12.05C29.19 11.07 29.62 10.2 30.04 9.44C30.46 8.68 30.78 8.22 31 8.06C31.22 7.88 31.57 7.79 32.05 7.79C32.53 7.79 32.94 7.97 33.28 8.33C33.64 8.67 33.82 9.08 33.82 9.56C33.82 10.04 33.75 10.59 33.61 11.21C32.05 18.83 31.27 23.39 31.27 24.89C31.27 26.37 31.51 27.38 31.99 27.92C32.47 28.48 33.31 28.87 34.51 29.09ZM47.3692 22.97L48.0592 23.48C47.7792 24.08 47.2592 24.65 46.4992 25.19C45.7592 25.73 45.0792 26 44.4592 26C43.2792 26 42.6892 25.38 42.6892 24.14C42.6892 23.56 42.8392 22.87 43.1392 22.07L42.0292 23.21C40.9492 24.31 40.0092 25.05 39.2092 25.43C38.4292 25.81 37.6592 26 36.8992 26C36.1392 26 35.5592 25.79 35.1592 25.37C34.7792 24.93 34.5892 24.33 34.5892 23.57C34.5892 22.17 35.1292 20.79 36.2092 19.43C37.2892 18.05 38.6692 16.93 40.3492 16.07C42.0292 15.21 43.7092 14.77 45.3892 14.75L45.4492 15.74L44.1892 16.01C42.3692 16.41 40.7592 17.21 39.3592 18.41C37.9792 19.61 37.2892 20.81 37.2892 22.01C37.2892 23.19 37.7692 23.78 38.7292 23.78C39.6292 23.78 40.7392 23.15 42.0592 21.89C43.3792 20.63 44.4792 19.15 45.3592 17.45L46.6192 18.2C45.3792 20.7 44.7592 22.29 44.7592 22.97C44.7592 23.25 44.8492 23.49 45.0292 23.69C45.2292 23.87 45.4192 23.96 45.5992 23.96C45.7992 23.96 45.9292 23.95 45.9892 23.93C46.0492 23.91 46.1092 23.89 46.1692 23.87C46.2292 23.83 46.2992 23.78 46.3792 23.72C46.4792 23.66 46.5592 23.6 46.6192 23.54C46.6992 23.48 46.8192 23.39 46.9792 23.27C47.1392 23.15 47.2692 23.05 47.3692 22.97ZM56.9617 15.38C57.4617 15.38 57.8717 15.55 58.1917 15.89C58.5117 16.23 58.6717 16.67 58.6717 17.21C58.6717 18.29 58.0517 19.43 56.8117 20.63L56.0917 20.06C56.3717 19.44 56.5117 18.99 56.5117 18.71C56.5117 18.17 56.2117 17.9 55.6117 17.9C55.0117 17.9 54.4417 18.28 53.9017 19.04C53.3617 19.8 52.7217 20.98 51.9817 22.58C51.2617 24.16 50.7117 25.28 50.3317 25.94L48.6217 25.19C49.7217 22.69 50.3517 21.22 50.5117 20.78C51.0517 19.22 51.3217 17.24 51.3217 14.84L53.0017 14.39C52.9417 15.69 52.8517 16.7 52.7317 17.42C52.6117 18.12 52.3217 19.27 51.8617 20.87C53.8817 17.21 55.5817 15.38 56.9617 15.38ZM71.3458 22.94L72.0958 23.6C70.9358 25.5 69.7058 26.45 68.4058 26.45C67.6058 26.45 66.7858 25.86 65.9458 24.68C65.1058 23.5 64.6858 22.53 64.6858 21.77C64.6858 21.29 65.4058 20.81 66.8458 20.33C67.3858 20.15 67.8758 19.88 68.3158 19.52C68.7758 19.14 69.0058 18.75 69.0058 18.35C69.0058 17.95 68.8958 17.65 68.6758 17.45C68.4558 17.23 68.1758 17.12 67.8358 17.12C65.6358 17.32 63.3358 20.28 60.9358 26L59.1058 25.37C59.1058 24.51 60.2658 21.03 62.5858 14.93C64.9258 8.83 66.5858 5.14 67.5658 3.86L69.0358 4.4C66.3358 9.1 64.0758 14.56 62.2558 20.78C63.8158 18.44 65.1558 16.88 66.2758 16.1C67.3958 15.32 68.4658 14.93 69.4858 14.93C70.1058 14.93 70.5958 15.12 70.9558 15.5C71.3358 15.88 71.5258 16.37 71.5258 16.97C71.5258 17.55 71.3758 18.08 71.0758 18.56C70.7958 19.04 70.3858 19.46 69.8458 19.82C69.0658 20.34 68.1058 20.85 66.9658 21.35C67.1458 22.29 67.4558 23 67.8958 23.48C68.3358 23.96 68.8358 24.2 69.3958 24.2C69.6958 24.2 70.3458 23.78 71.3458 22.94ZM81.2195 22.46L81.9095 23C81.2895 23.86 80.4395 24.58 79.3595 25.16C78.2795 25.72 77.2295 26 76.2095 26C75.1895 26 74.3695 25.7 73.7495 25.1C73.1295 24.5 72.8195 23.71 72.8195 22.73C72.8195 20.89 73.7895 19.08 75.7295 17.3C77.6895 15.52 79.6695 14.63 81.6695 14.63C82.9895 14.63 83.6495 15.15 83.6495 16.19C83.6495 17.27 82.9495 18.36 81.5495 19.46C80.1695 20.56 78.2195 21.56 75.6995 22.46C75.8795 22.92 76.1595 23.28 76.5395 23.54C76.9195 23.8 77.3095 23.93 77.7095 23.93C78.5695 23.93 79.7395 23.44 81.2195 22.46ZM75.5495 21.56C77.1695 21 78.5595 20.3 79.7195 19.46C80.8795 18.62 81.4595 17.85 81.4595 17.15C81.4595 16.89 81.3595 16.66 81.1595 16.46C80.9595 16.26 80.7295 16.16 80.4695 16.16C79.5295 16.16 78.5095 16.75 77.4095 17.93C76.3295 19.09 75.7095 20.3 75.5495 21.56ZM91.2653 22.64L91.9253 23.39C91.4253 24.17 90.8153 24.78 90.0953 25.22C89.3953 25.66 88.6853 25.88 87.9653 25.88C87.2453 25.88 86.6753 25.68 86.2553 25.28C85.8353 24.86 85.6253 24.29 85.6253 23.57C85.6253 21.89 86.2553 19.57 87.5153 16.61C86.4953 16.77 85.4753 17.01 84.4553 17.33L84.2453 16.16L84.2153 16.13C85.2153 15.71 86.5253 15.37 88.1453 15.11C88.3053 14.81 88.6653 14.08 89.2253 12.92C90.3453 10.62 91.1453 9.13 91.6253 8.45L92.9153 8.96C92.7153 9.4 92.3653 10.14 91.8653 11.18C91.3653 12.2 90.8053 13.36 90.1853 14.66C91.0853 14.6 91.7953 14.57 92.3153 14.57C92.8353 14.57 93.2353 14.65 93.5153 14.81V16.1C93.2353 16.04 92.8253 16.01 92.2853 16.01C91.7653 16.01 90.8253 16.1 89.4653 16.28C88.2853 18.92 87.6953 20.84 87.6953 22.04C87.6953 22.5 87.8353 22.88 88.1153 23.18C88.4153 23.48 88.8053 23.63 89.2853 23.63C89.7853 23.63 90.4453 23.3 91.2653 22.64ZM104.678 9.5C106.318 8.38 107.438 7.7 108.038 7.46C108.638 7.2 109.338 7.07 110.138 7.07C110.958 7.07 111.588 7.35 112.028 7.91C112.468 8.47 112.688 9.27 112.688 10.31C112.688 12.17 112.088 14.17 110.888 16.31C109.688 18.45 108.188 20.25 106.388 21.71C104.588 23.15 102.888 23.87 101.288 23.87C100.888 23.87 100.428 23.85 99.9077 23.81C98.9277 25.89 98.0377 27.46 97.2377 28.52C96.4377 29.58 95.6377 30.11 94.8377 30.11C94.3377 30.11 93.9477 29.93 93.6677 29.57C93.3877 29.21 93.2477 28.71 93.2477 28.07C93.2477 26.01 94.1977 23.26 96.0977 19.82C97.9977 16.36 100.088 13.59 102.368 11.51C102.688 10.19 102.848 9.23 102.848 8.63C102.848 8.01 102.828 7.54 102.788 7.22L104.948 6.86C104.948 7 104.858 7.88 104.678 9.5ZM97.8077 21.65L98.6477 22.07C99.9077 19.61 100.968 16.85 101.828 13.79C99.9877 16.09 98.4777 18.43 97.2977 20.81C96.1177 23.19 95.5277 25.02 95.5277 26.3C95.5277 26.68 95.6477 26.87 95.8877 26.87C96.0677 26.87 96.3877 26.5 96.8477 25.76C97.3077 25 97.6977 24.23 98.0177 23.45C97.7577 23.33 97.5077 23.15 97.2677 22.91L97.8077 21.65ZM100.538 22.49L101.108 22.52C103.048 22.52 104.868 21.5 106.568 19.46C107.528 18.28 108.338 16.93 108.998 15.41C109.678 13.89 110.018 12.6 110.018 11.54C110.018 10.96 109.858 10.5 109.538 10.16C109.238 9.82 108.818 9.65 108.278 9.65C107.298 9.65 105.998 10.19 104.378 11.27C104.018 13.97 102.738 17.71 100.538 22.49ZM118.574 23.12L119.204 23.63C118.524 24.69 117.934 25.46 117.434 25.94C116.954 26.4 116.414 26.63 115.814 26.63C115.214 26.63 114.724 26.39 114.344 25.91C113.964 25.43 113.774 24.83 113.774 24.11C113.774 22.71 114.694 19.7 116.534 15.08C118.374 10.44 120.264 6.36 122.204 2.84L123.524 3.56C121.564 7.36 119.794 11.14 118.214 14.9C116.634 18.64 115.844 21.33 115.844 22.97C115.844 23.91 116.194 24.38 116.894 24.38C117.454 24.38 118.014 23.96 118.574 23.12ZM134.908 22.97L135.598 23.48C135.318 24.08 134.798 24.65 134.038 25.19C133.298 25.73 132.618 26 131.998 26C130.818 26 130.228 25.38 130.228 24.14C130.228 23.56 130.378 22.87 130.678 22.07L129.568 23.21C128.488 24.31 127.548 25.05 126.748 25.43C125.968 25.81 125.198 26 124.438 26C123.678 26 123.098 25.79 122.698 25.37C122.318 24.93 122.128 24.33 122.128 23.57C122.128 22.17 122.668 20.79 123.748 19.43C124.828 18.05 126.208 16.93 127.888 16.07C129.568 15.21 131.248 14.77 132.928 14.75L132.988 15.74L131.728 16.01C129.908 16.41 128.298 17.21 126.898 18.41C125.518 19.61 124.828 20.81 124.828 22.01C124.828 23.19 125.308 23.78 126.268 23.78C127.168 23.78 128.278 23.15 129.598 21.89C130.918 20.63 132.018 19.15 132.898 17.45L134.158 18.2C132.918 20.7 132.298 22.29 132.298 22.97C132.298 23.25 132.388 23.49 132.568 23.69C132.768 23.87 132.958 23.96 133.138 23.96C133.338 23.96 133.468 23.95 133.528 23.93C133.588 23.91 133.648 23.89 133.708 23.87C133.768 23.83 133.838 23.78 133.918 23.72C134.018 23.66 134.098 23.6 134.158 23.54C134.238 23.48 134.358 23.39 134.518 23.27C134.678 23.15 134.808 23.05 134.908 22.97ZM144.231 21.74L144.951 22.34C144.471 23.44 143.701 24.32 142.641 24.98C141.581 25.64 140.551 25.97 139.551 25.97C138.571 25.97 137.751 25.66 137.091 25.04C136.451 24.42 136.131 23.57 136.131 22.49C136.131 21.41 136.601 20.24 137.541 18.98C138.481 17.72 139.691 16.68 141.171 15.86C142.671 15.04 144.141 14.63 145.581 14.63C145.781 14.63 146.081 14.65 146.481 14.69L146.391 15.86C144.191 15.96 142.361 16.63 140.901 17.87C139.461 19.11 138.741 20.43 138.741 21.83C138.741 22.41 138.921 22.88 139.281 23.24C139.641 23.6 140.111 23.78 140.691 23.78C141.611 23.78 142.791 23.1 144.231 21.74ZM155.458 22.46L156.148 23C155.528 23.86 154.678 24.58 153.598 25.16C152.518 25.72 151.468 26 150.448 26C149.428 26 148.608 25.7 147.988 25.1C147.368 24.5 147.058 23.71 147.058 22.73C147.058 20.89 148.028 19.08 149.968 17.3C151.928 15.52 153.908 14.63 155.908 14.63C157.228 14.63 157.888 15.15 157.888 16.19C157.888 17.27 157.188 18.36 155.788 19.46C154.408 20.56 152.458 21.56 149.938 22.46C150.118 22.92 150.398 23.28 150.778 23.54C151.158 23.8 151.548 23.93 151.948 23.93C152.808 23.93 153.978 23.44 155.458 22.46ZM149.788 21.56C151.408 21 152.798 20.3 153.958 19.46C155.118 18.62 155.698 17.85 155.698 17.15C155.698 16.89 155.598 16.66 155.398 16.46C155.198 16.26 154.968 16.16 154.708 16.16C153.768 16.16 152.748 16.75 151.648 17.93C150.568 19.09 149.948 20.3 149.788 21.56Z" fill="white"/>
</svg>
 
                        </a>
                 </div>
                 <div class="zleft-left">
                <div class="zleft-icon"><a href="http://telegram.com">
                <i class="fab fa-telegram-plane fa-2x"></i></a>
                </div>
                <div class="zleft-icon"><a href="http://instagram.com">
                <i class="fab fa-instagram fa-2x"></i></a>
                </div>
                <div class="zleft-icon"><a href="http://telegram.com">
                <i class="fab fa-facebook-f fa-2x"></i></i></a>
                </div>
                </div>
                
                
            '. ZHInputWidget::widget(
                [
                    'id'=>'subscribe',
                    'config'=>[
                        'placeholder'=>Az::l('Email')
                    ]
                ]
            ) . ZButtonWidget::widget([
                    'config' => [
                        'text' => Az::l('Subscribe'),
                        /*'btnStyle' => ZButtonWidget::btnStyle['btn-danger'],*/
                        'btnSize' => ZButtonWidget::btnSize['btn-lg'],
                        'btnRounded' => false,
                        'hasIcon' => true,
                        'icon'=>'far fa-bell',
                        'class'=>'w-100 malika'
                    ]
                ]),
            '{url}' => $this->_config['url']
        ]);

        $this->htm = strtr($this->_layout['main'], [
            '{color}' => $this->_config['color'],
            '{color_company}' => '#0049ff',
            '{class}' => $this->_config['class'],
            '{menulist}' => $categoryListCode,
            '{url}' => $this->_config['url']
        ]);

        $this->css = strtr($this->_layout['css'], [
            '{color}' => $this->_config['color'],
        ]);
        $this->js = strtr($this->_layout['js'], [
            '{id}' => $this->id,
        ]);


    }

}

